Tester/src/Catalogs/Tags/Tags.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Tags</name>
  <attributes>
    <name>Explanation</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Tester/src/Catalogs/TagKeys/TagKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>TagKeys</name>
  <tabularSections>
    <name>Tags</name>
    <attributes>
      <name>Tag</name>
      <type>
        <types>CatalogRef.Tags</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/Catalogs/Tags/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	OldName = Object.Description;
	
EndProcedure

&AtServer
Procedure OnWriteAtServer ( Cancel, CurrentObject, WriteParameters )
	
	if ( OldName <> "" and OldName <> Object.Description ) then
		updateKeys ();
	endif; 
	
EndProcedure

&AtServer
Procedure updateKeys ()
	
	lock ();
	list = getKeys ();
	for each ref in list do
		obj = ref.GetObject ();
		obj.SetDescription ();
		obj.Write ();
	enddo; 
	
EndProcedure 

&AtServer
Procedure lock ()
	
	lock = new DataLock ();
	item = lock.Add ( "Catalog.TagKeys" );
	item.Mode = DataLockMode.Exclusive;
	lock.Lock ();
	
EndProcedure 

&AtServer
Function getKeys ()
	
	s = "
	|select Tags.Ref as Ref
	|from Catalog.TagKeys.Tags as Tags
	|where Tags.Tag = &Tag
	|";
	q = new Query ( s );
	q.SetParameter ( "Tag", Object.Ref );
	return q.Execute ().Unload ().UnloadColumn ( "Ref" );
	
EndFunction
